[
  {
    "Author": "Sebastian Thiel, Michael Trier",
    "Description": "Python Git Library",
    "License": "BSD License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/GitPython-3.1.7.dist-info/LICENSE",
    "LicenseText": "Copyright (C) 2008, 2009 Michael Trier and contributors\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without \nmodification, are permitted provided that the following conditions \nare met:\n\n* Redistributions of source code must retain the above copyright \nnotice, this list of conditions and the following disclaimer.\n\n* Redistributions in binary form must reproduce the above copyright \nnotice, this list of conditions and the following disclaimer in the \ndocumentation and/or other materials provided with the distribution.\n\n* Neither the name of the GitPython project nor the names of \nits contributors may be used to endorse or promote products derived \nfrom this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT \nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR \nA PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT \nOWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, \nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED \nTO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR \nPROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF \nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING \nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS \nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n",
    "Name": "GitPython",
    "URL": "https://github.com/gitpython-developers/GitPython",
    "Version": "3.1.7"
  },
  {
    "Author": "Armin Ronacher",
    "Description": "A very fast and expressive template engine.",
    "License": "BSD License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/Jinja2-2.11.2.dist-info/LICENSE.rst",
    "LicenseText": "Copyright 2007 Pallets\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n1.  Redistributions of source code must retain the above copyright\n    notice, this list of conditions and the following disclaimer.\n\n2.  Redistributions in binary form must reproduce the above copyright\n    notice, this list of conditions and the following disclaimer in the\n    documentation and/or other materials provided with the distribution.\n\n3.  Neither the name of the copyright holder nor the names of its\n    contributors may be used to endorse or promote products derived from\n    this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A\nPARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\nHOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED\nTO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\nPROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n",
    "Name": "Jinja2",
    "URL": "https://palletsprojects.com/p/jinja/",
    "Version": "2.11.2"
  },
  {
    "Author": "Armin Ronacher",
    "Description": "Safely add untrusted strings to HTML/XML markup.",
    "License": "BSD License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/MarkupSafe-1.1.1.dist-info/LICENSE.txt",
    "LicenseText": "Copyright 2010 Pallets\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n1.  Redistributions of source code must retain the above copyright\n    notice, this list of conditions and the following disclaimer.\n\n2.  Redistributions in binary form must reproduce the above copyright\n    notice, this list of conditions and the following disclaimer in the\n    documentation and/or other materials provided with the distribution.\n\n3.  Neither the name of the copyright holder nor the names of its\n    contributors may be used to endorse or promote products derived from\n    this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A\nPARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\nHOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED\nTO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\nPROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n",
    "Name": "MarkupSafe",
    "URL": "https://palletsprojects.com/p/markupsafe/",
    "Version": "1.1.1"
  },
  {
    "Author": "Davide Spadini",
    "Description": "Framework for MSR",
    "License": "Apache Software License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/PyDriller-1.15.2.dist-info/LICENSE",
    "LicenseText": "\n                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS",
    "Name": "PyDriller",
    "URL": "https://github.com/ishepard/pydriller",
    "Version": "1.15.2"
  },
  {
    "Author": "Jose Padilla",
    "Description": "JSON Web Token implementation in Python",
    "License": "MIT License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/PyJWT-1.7.1.dist-info/LICENSE",
    "LicenseText": "The MIT License (MIT)\n\nCopyright (c) 2015 José Padilla\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n",
    "Name": "PyJWT",
    "URL": "http://github.com/jpadilla/pyjwt",
    "Version": "1.7.1"
  },
  {
    "Author": "Georg Brandl",
    "Description": "Pygments is a syntax highlighting package written in Python.",
    "License": "BSD License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/Pygments-2.6.1.dist-info/LICENSE",
    "LicenseText": "Copyright (c) 2006-2019 by the respective authors (see AUTHORS file).\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n* Redistributions of source code must retain the above copyright\n  notice, this list of conditions and the following disclaimer.\n\n* Redistributions in binary form must reproduce the above copyright\n  notice, this list of conditions and the following disclaimer in the\n  documentation and/or other materials provided with the distribution.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\nOWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n",
    "Name": "Pygments",
    "URL": "https://pygments.org/",
    "Version": "2.6.1"
  },
  {
    "Author": "Oliver Schoenborn (aka \"schollii\")",
    "Description": "Python Publish-Subscribe Package",
    "License": "BSD License",
    "LicenseFile": "UNKNOWN",
    "LicenseText": "UNKNOWN",
    "Name": "Pypubsub",
    "URL": "https://github.com/schollii/pypubsub",
    "Version": "4.0.3"
  },
  {
    "Author": "Alex Grönholm",
    "Description": "High level compatibility layer for multiple asynchronous event loop implementations",
    "License": "MIT License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/anyio-1.4.0.dist-info/LICENSE",
    "LicenseText": "This is the MIT license: http://www.opensource.org/licenses/mit-license.php\n\nCopyright (c) Alex Grönholm\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this\nsoftware and associated documentation files (the \"Software\"), to deal in the Software\nwithout restriction, including without limitation the rights to use, copy, modify, merge,\npublish, distribute, sublicense, and/or sell copies of the Software, and to permit persons\nto whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or\nsubstantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,\nINCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR\nPURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE\nFOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR\nOTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER\nDEALINGS IN THE SOFTWARE.\n",
    "Name": "anyio",
    "URL": "UNKNOWN",
    "Version": "1.4.0"
  },
  {
    "Author": "Trent Mick",
    "Description": "A small Python module for determining appropriate platform-specific dirs, e.g. a \"user data dir\".",
    "License": "MIT License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/appdirs-1.4.4.dist-info/LICENSE.txt",
    "LicenseText": "# This is the MIT license\n\nCopyright (c) 2010 ActiveState Software Inc.\n\nPermission is hereby granted, free of charge, to any person obtaining a\ncopy of this software and associated documentation files (the\n\"Software\"), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, sublicense, and/or sell copies of the Software, and to\npermit persons to whom the Software is furnished to do so, subject to\nthe following conditions:\n\nThe above copyright notice and this permission notice shall be included\nin all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS\nOR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\nIN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY\nCLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,\nTORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE\nSOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n",
    "Name": "appdirs",
    "URL": "http://github.com/ActiveState/appdirs",
    "Version": "1.4.4"
  },
  {
    "Author": "Chris Smith",
    "Description": "Better dates & times for Python",
    "License": "Apache Software License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/arrow-0.15.8.dist-info/LICENSE",
    "LicenseText": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright 2019 Chris Smith\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n",
    "Name": "arrow",
    "URL": "https://arrow.readthedocs.io",
    "Version": "0.15.8"
  },
  {
    "Author": "Nathaniel J. Smith",
    "Description": "Async generators and context managers for Python 3.5+",
    "License": "MIT License, Apache Software License",
    "LicenseFile": "UNKNOWN",
    "LicenseText": "UNKNOWN",
    "Name": "async-generator",
    "URL": "https://github.com/python-trio/async_generator",
    "Version": "1.10"
  },
  {
    "Author": "Matthias Urlichs",
    "Description": "A simple anyio-compatible fork of Click, for powerful command line utilities.",
    "License": "BSD License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/asyncclick-7.0.9.dist-info/LICENSE.rst",
    "LicenseText": "Copyright © 2014 by the Pallets team.\n\nSome rights reserved.\n\nRedistribution and use in source and binary forms of the software as\nwell as documentation, with or without modification, are permitted\nprovided that the following conditions are met:\n\n-   Redistributions of source code must retain the above copyright\n    notice, this list of conditions and the following disclaimer.\n\n-   Redistributions in binary form must reproduce the above copyright\n    notice, this list of conditions and the following disclaimer in the\n    documentation and/or other materials provided with the distribution.\n\n-   Neither the name of the copyright holder nor the names of its\n    contributors may be used to endorse or promote products derived from\n    this software without specific prior written permission.\n\nTHIS SOFTWARE AND DOCUMENTATION IS PROVIDED BY THE COPYRIGHT HOLDERS AND\nCONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING,\nBUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\nFITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE\nCOPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,\nINCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT\nNOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF\nUSE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF\nTHIS SOFTWARE AND DOCUMENTATION, EVEN IF ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGE.\n\n----\n\nClick uses parts of optparse written by Gregory P. Ward and maintained\nby the Python Software Foundation. This is limited to code in parser.py.\n\nCopyright © 2001-2006 Gregory P. Ward. All rights reserved.\nCopyright © 2002-2006 Python Software Foundation. All rights reserved.\n",
    "Name": "asyncclick",
    "URL": "http://github.com/python-trio/asyncclick",
    "Version": "7.0.9"
  },
  {
    "Author": "Markus Binsteiner",
    "Description": "Package manager for files and file-sets.",
    "License": "\"The Parity Public License 6.0.0\"",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/bring-0.1.dev383+gbea308d.d20200809.dist-info/LICENSE",
    "LicenseText": "The Parity Public License 6.0.0\n\nContributor: Markus Binsteiner\n\nSource Code: https://gitlab.com/frkl/bring\n\n\nThis license lets you use and share this software for free, as\nlong as you contribute software you make with it. Specifically:\n\nIf you follow the rules below, you may do everything with this\nsoftware that would otherwise infringe either the contributor's\ncopyright in it, any patent claim the contributor can license,\nor both.\n\n1. Contribute changes and additions you make to this software.\n\n2. If you combine this software with other software, contribute\n   that other software.\n\n3. Contribute software you develop, deploy, monitor, or run with\n   this software.\n\n4. Ensure everyone who gets a copy of this software from you, in\n   source code or any other form, gets the text of this license\n   and the contributor and source code lines above.\n\n5. Do not make any legal claim against anyone accusing this\n   software, with or without changes, alone or with other\n   software, of infringing any patent claim.\n\nTo contribute software, publish all its source code, in the\npreferred form for making changes, through a freely accessible\ndistribution system widely used for similar source code, and\nlicense contributions not already licensed to the public on terms\nas permissive as this license accordingly.\n\nYou are excused for unknowingly breaking 1, 2, or 3 if you\ncontribute as required, or stop doing anything requiring this\nlicense, within 30 days of learning you broke the rule.\n\n**As far as the law allows, this software comes as is, without\nany warranty, and the contributor will not be liable to anyone\nfor any damages related to this software or this license, for any\nkind of legal claim.**\n",
    "Name": "bring",
    "URL": "https://gitlab.com/frkl/bring",
    "Version": "0.1.dev383+gbea308d.d20200809"
  },
  {
    "Author": "PyYoshi",
    "Description": "cChardet is high speed universal character encoding detector.",
    "License": "Mozilla Public License 1.1 (MPL 1.1), GNU General Public License (GPL), GNU Library or Lesser General Public License (LGPL)",
    "LicenseFile": "UNKNOWN",
    "LicenseText": "UNKNOWN",
    "Name": "cchardet",
    "URL": "https://github.com/PyYoshi/cChardet",
    "Version": "2.1.6"
  },
  {
    "Author": "Kenneth Reitz",
    "Description": "Python package for providing Mozilla's CA Bundle.",
    "License": "Mozilla Public License 2.0 (MPL 2.0)",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/certifi-2020.6.20.dist-info/LICENSE",
    "LicenseText": "This packge contains a modified version of ca-bundle.crt:\n\nca-bundle.crt -- Bundle of CA Root Certificates\n\nCertificate data from Mozilla as of: Thu Nov  3 19:04:19 2011#\nThis is a bundle of X.509 certificates of public Certificate Authorities\n(CA). These were automatically extracted from Mozilla's root certificates\nfile (certdata.txt).  This file can be found in the mozilla source tree:\nhttp://mxr.mozilla.org/mozilla/source/security/nss/lib/ckfw/builtins/certdata.txt?raw=1#\nIt contains the certificates in PEM format and therefore\ncan be directly used with curl / libcurl / php_curl, or with\nan Apache+mod_ssl webserver for SSL client authentication.\nJust configure this file as the SSLCACertificateFile.#\n\n***** BEGIN LICENSE BLOCK *****\nThis Source Code Form is subject to the terms of the Mozilla Public License,\nv. 2.0. If a copy of the MPL was not distributed with this file, You can obtain\none at http://mozilla.org/MPL/2.0/.\n\n***** END LICENSE BLOCK *****\n@(#) $RCSfile: certdata.txt,v $ $Revision: 1.80 $ $Date: 2011/11/03 15:11:58 $\n",
    "Name": "certifi",
    "URL": "https://certifiio.readthedocs.io/en/latest/",
    "Version": "2020.6.20"
  },
  {
    "Author": "Armin Rigo, Maciej Fijalkowski",
    "Description": "Foreign Function Interface for Python calling C code.",
    "License": "MIT License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/cffi-1.14.1.dist-info/LICENSE",
    "LicenseText": "\nExcept when otherwise stated (look for LICENSE files in directories or\ninformation at the beginning of each file) all software and\ndocumentation is licensed as follows: \n\n    The MIT License\n\n    Permission is hereby granted, free of charge, to any person \n    obtaining a copy of this software and associated documentation \n    files (the \"Software\"), to deal in the Software without \n    restriction, including without limitation the rights to use, \n    copy, modify, merge, publish, distribute, sublicense, and/or \n    sell copies of the Software, and to permit persons to whom the \n    Software is furnished to do so, subject to the following conditions:\n\n    The above copyright notice and this permission notice shall be included \n    in all copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS \n    OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, \n    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL \n    THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER \n    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING \n    FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER \n    DEALINGS IN THE SOFTWARE.\n\n",
    "Name": "cffi",
    "URL": "http://cffi.readthedocs.org",
    "Version": "1.14.1"
  },
  {
    "Author": "Jonathan Hartley",
    "Description": "Cross-platform colored terminal text.",
    "License": "BSD License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/colorama-0.4.3.dist-info/LICENSE.txt",
    "LicenseText": "Copyright (c) 2010 Jonathan Hartley\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n* Redistributions of source code must retain the above copyright notice, this\n  list of conditions and the following disclaimer.\n\n* Redistributions in binary form must reproduce the above copyright notice,\n  this list of conditions and the following disclaimer in the documentation\n  and/or other materials provided with the distribution.\n\n* Neither the name of the copyright holders, nor those of its contributors\n  may be used to endorse or promote products derived from this software without\n  specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\nCAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n",
    "Name": "colorama",
    "URL": "https://github.com/tartley/colorama",
    "Version": "0.4.3"
  },
  {
    "Author": "Bibek Kafle <bkafle662@gmail.com>, Roland Shoemaker <rolandshoemaker@gmail.com>",
    "Description": "Python parser for the CommonMark Markdown spec",
    "License": "BSD License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/commonmark-0.9.1.dist-info/LICENSE",
    "LicenseText": "Copyright (c) 2014, Bibek Kafle and Roland Shoemaker\n\nBased on stmd.js: Copyright (c) 2014, John MacFarlane\n\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n    * Redistributions of source code must retain the above copyright\n      notice, this list of conditions and the following disclaimer.\n\n    * Redistributions in binary form must reproduce the above\n      copyright notice, this list of conditions and the following\n      disclaimer in the documentation and/or other materials provided\n      with the distribution.\n\n    * Neither the names of Bibek Kafle, Roland Shoemaker nor the names of other\n      contributors may be used to endorse or promote products derived\n      from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\nOWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.",
    "Name": "commonmark",
    "URL": "https://github.com/rtfd/commonmark.py",
    "Version": "0.9.1"
  },
  {
    "Author": "The cryptography developers",
    "Description": "cryptography is a package which provides cryptographic recipes and primitives to Python developers.",
    "License": "Apache Software License, BSD License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/cryptography-3.0.dist-info/LICENSE",
    "LicenseText": "This software is made available under the terms of *either* of the licenses\nfound in LICENSE.APACHE or LICENSE.BSD. Contributions to cryptography are made\nunder the terms of *both* these licenses.\n\nThe code used in the OpenSSL locking callback and OS random engine is derived\nfrom CPython, and is licensed under the terms of the PSF License Agreement.\n",
    "Name": "cryptography",
    "URL": "https://github.com/pyca/cryptography",
    "Version": "3.0"
  },
  {
    "Author": "Seperman",
    "Description": "Deep Difference and Search of any Python object/data.",
    "License": "MIT License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/deepdiff-5.0.2.dist-info/LICENSE",
    "LicenseText": "The MIT License (MIT)\n\nCopyright (c) 2014 - 2020 Sep Dehpour (Seperman) and contributors\nwww.zepworks.com\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\n",
    "Name": "deepdiff",
    "URL": "https://github.com/seperman/deepdiff",
    "Version": "5.0.2"
  },
  {
    "Author": "Invenio Collaboration",
    "Description": "Dictdiffer is a library that helps you to diff and patch dictionaries.",
    "License": "MIT License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/dictdiffer-0.8.1.dist-info/LICENSE",
    "LicenseText": "Dictdiffer is free software; you can redistribute it and/or modify it\nunder the terms of the MIT License quoted below.\n\nCopyright (C) 2013 Fatih Erikli.\nCopyright (C) 2013, 2014 CERN.\n\nPermission is hereby granted, free of charge, to any person obtaining\na copy of this software and associated documentation files (the\n\"Software\"), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, sublicense, and/or sell copies of the Software, and to\npermit persons to whom the Software is furnished to do so, subject to\nthe following conditions:\n\nThe above copyright notice and this permission notice shall be\nincluded in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\nNONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE\nLIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION\nOF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION\nWITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nIn applying this license, CERN does not waive the privileges and\nimmunities granted to it by virtue of its status as an\nIntergovernmental Organization or submit itself to any jurisdiction.\n",
    "Name": "dictdiffer",
    "URL": "https://github.com/inveniosoftware/dictdiffer",
    "Version": "0.8.1"
  },
  {
    "Author": "Caleb Case, Andrew Kesterson",
    "Description": "Filesystem-like pathing and searching for dictionaries",
    "License": "MIT License",
    "LicenseFile": "UNKNOWN",
    "LicenseText": "UNKNOWN",
    "Name": "dpath",
    "URL": "https://www.github.com/akesterson/dpath-python",
    "Version": "2.0.1"
  },
  {
    "Author": "Miki Tebeka",
    "Description": "Fast read/write of AVRO files",
    "License": "MIT License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/fastavro-0.23.6.dist-info/LICENSE",
    "LicenseText": "MIT License\n\nCopyright (c) 2011 Miki Tebeka\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n",
    "Name": "fastavro",
    "URL": "https://github.com/fastavro/fastavro",
    "Version": "0.23.6"
  },
  {
    "Author": "Markus Binsteiner",
    "Description": "Core module for freckles v2",
    "License": "\"The Parity Public License 6.0.0\"",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/freckles.core-0.1.dev19+g5fdf230.dist-info/LICENSE",
    "LicenseText": "The Parity Public License 6.0.0\n\nContributor: Markus Binsteiner\n\nSource Code: https://gitlab.com/frkl/freckles.core\n\n\nThis license lets you use and share this software for free, as\nlong as you contribute software you make with it. Specifically:\n\nIf you follow the rules below, you may do everything with this\nsoftware that would otherwise infringe either the contributor's\ncopyright in it, any patent claim the contributor can license,\nor both.\n\n1. Contribute changes and additions you make to this software.\n\n2. If you combine this software with other software, contribute\n   that other software.\n\n3. Contribute software you develop, deploy, monitor, or run with\n   this software.\n\n4. Ensure everyone who gets a copy of this software from you, in\n   source code or any other form, gets the text of this license\n   and the contributor and source code lines above.\n\n5. Do not make any legal claim against anyone accusing this\n   software, with or without changes, alone or with other\n   software, of infringing any patent claim.\n\nTo contribute software, publish all its source code, in the\npreferred form for making changes, through a freely accessible\ndistribution system widely used for similar source code, and\nlicense contributions not already licensed to the public on terms\nas permissive as this license accordingly.\n\nYou are excused for unknowingly breaking 1, 2, or 3 if you\ncontribute as required, or stop doing anything requiring this\nlicense, within 30 days of learning you broke the rule.\n\n**As far as the law allows, this software comes as is, without\nany warranty, and the contributor will not be liable to anyone\nfor any damages related to this software or this license, for any\nkind of legal claim.**\n",
    "Name": "freckles.core",
    "URL": "https://gitlab.com/frkl/freckles_core",
    "Version": "0.1.dev19+g5fdf230"
  },
  {
    "Author": "Markus Binsteiner",
    "Description": "Library to manage arguments, incl. metadata.",
    "License": "\"The Parity Public License 6.0.0\"",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/frkl.args-0.1.dev19+g2ec5eae.dist-info/LICENSE",
    "LicenseText": "The Parity Public License 6.0.0\n\nContributor: Markus Binsteiner\n\nSource Code: https://gitlab.com/frkl/frkl.args\n\n\nThis license lets you use and share this software for free, as\nlong as you contribute software you make with it. Specifically:\n\nIf you follow the rules below, you may do everything with this\nsoftware that would otherwise infringe either the contributor's\ncopyright in it, any patent claim the contributor can license,\nor both.\n\n1. Contribute changes and additions you make to this software.\n\n2. If you combine this software with other software, contribute\n   that other software.\n\n3. Contribute software you develop, deploy, monitor, or run with\n   this software.\n\n4. Ensure everyone who gets a copy of this software from you, in\n   source code or any other form, gets the text of this license\n   and the contributor and source code lines above.\n\n5. Do not make any legal claim against anyone accusing this\n   software, with or without changes, alone or with other\n   software, of infringing any patent claim.\n\nTo contribute software, publish all its source code, in the\npreferred form for making changes, through a freely accessible\ndistribution system widely used for similar source code, and\nlicense contributions not already licensed to the public on terms\nas permissive as this license accordingly.\n\nYou are excused for unknowingly breaking 1, 2, or 3 if you\ncontribute as required, or stop doing anything requiring this\nlicense, within 30 days of learning you broke the rule.\n\n**As far as the law allows, this software comes as is, without\nany warranty, and the contributor will not be liable to anyone\nfor any damages related to this software or this license, for any\nkind of legal claim.**\n",
    "Name": "frkl.args",
    "URL": "https://gitlab.com/frkl/frkl_args",
    "Version": "0.1.dev19+g2ec5eae"
  },
  {
    "Author": "Audrey Roy Greenfeld",
    "Description": "Ultra-lightweight pure Python package to check if a file is binary or text.",
    "License": "BSD License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/frkl.binaryornot-0.4.4.dist-info/LICENSE",
    "LicenseText": "Copyright (c) 2013, Audrey Roy\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n* Redistributions of source code must retain the above copyright notice, this\n  list of conditions and the following disclaimer.\n\n* Redistributions in binary form must reproduce the above copyright notice,\n  this list of conditions and the following disclaimer in the documentation\n  and/or other materials provided with the distribution.\n\n* Neither the name of BinaryOrNot nor the names of its contributors may be used\n  to endorse or promote products derived from this software without specific\n  prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\nCAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n",
    "Name": "frkl.binaryornot",
    "URL": "https://github.com/audreyr/binaryornot",
    "Version": "0.4.4"
  },
  {
    "Author": "Markus Binsteiner",
    "Description": "Shared utilities and code for frkl projects.",
    "License": "\"The Parity Public License 6.0.0\"",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/frkl.common-0.1.dev66+g55d3930.dist-info/LICENSE",
    "LicenseText": "The Parity Public License 6.0.0\n\nContributor: Markus Binsteiner\n\nSource Code: https://gitlab.com/frkl/frkl.common\n\n\nThis license lets you use and share this software for free, as\nlong as you contribute software you make with it. Specifically:\n\nIf you follow the rules below, you may do everything with this\nsoftware that would otherwise infringe either the contributor's\ncopyright in it, any patent claim the contributor can license,\nor both.\n\n1. Contribute changes and additions you make to this software.\n\n2. If you combine this software with other software, contribute\n   that other software.\n\n3. Contribute software you develop, deploy, monitor, or run with\n   this software.\n\n4. Ensure everyone who gets a copy of this software from you, in\n   source code or any other form, gets the text of this license\n   and the contributor and source code lines above.\n\n5. Do not make any legal claim against anyone accusing this\n   software, with or without changes, alone or with other\n   software, of infringing any patent claim.\n\nTo contribute software, publish all its source code, in the\npreferred form for making changes, through a freely accessible\ndistribution system widely used for similar source code, and\nlicense contributions not already licensed to the public on terms\nas permissive as this license accordingly.\n\nYou are excused for unknowingly breaking 1, 2, or 3 if you\ncontribute as required, or stop doing anything requiring this\nlicense, within 30 days of learning you broke the rule.\n\n**As far as the law allows, this software comes as is, without\nany warranty, and the contributor will not be liable to anyone\nfor any damages related to this software or this license, for any\nkind of legal claim.**\n",
    "Name": "frkl.common",
    "URL": "https://gitlab.com/frkl/frkl_common",
    "Version": "0.1.dev66+g55d3930"
  },
  {
    "Author": "Markus Binsteiner",
    "Description": "Manage and connect event sources and targets.",
    "License": "\"The Parity Public License 6.0.0\"",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/frkl.events-0.1.dev16+g9bed003.dist-info/LICENSE",
    "LicenseText": "The Parity Public License 6.0.0\n\nContributor: Markus Binsteiner\n\nSource Code: https://gitlab.com/frkl/frkl.events\n\n\nThis license lets you use and share this software for free, as\nlong as you contribute software you make with it. Specifically:\n\nIf you follow the rules below, you may do everything with this\nsoftware that would otherwise infringe either the contributor's\ncopyright in it, any patent claim the contributor can license,\nor both.\n\n1. Contribute changes and additions you make to this software.\n\n2. If you combine this software with other software, contribute\n   that other software.\n\n3. Contribute software you develop, deploy, monitor, or run with\n   this software.\n\n4. Ensure everyone who gets a copy of this software from you, in\n   source code or any other form, gets the text of this license\n   and the contributor and source code lines above.\n\n5. Do not make any legal claim against anyone accusing this\n   software, with or without changes, alone or with other\n   software, of infringing any patent claim.\n\nTo contribute software, publish all its source code, in the\npreferred form for making changes, through a freely accessible\ndistribution system widely used for similar source code, and\nlicense contributions not already licensed to the public on terms\nas permissive as this license accordingly.\n\nYou are excused for unknowingly breaking 1, 2, or 3 if you\ncontribute as required, or stop doing anything requiring this\nlicense, within 30 days of learning you broke the rule.\n\n**As far as the law allows, this software comes as is, without\nany warranty, and the contributor will not be liable to anyone\nfor any damages related to this software or this license, for any\nkind of legal claim.**\n",
    "Name": "frkl.events",
    "URL": "https://gitlab.com/frkl/frkl_events",
    "Version": "0.1.dev16+g9bed003"
  },
  {
    "Author": "Markus Binsteiner",
    "Description": "Explain objects.",
    "License": "\"The Parity Public License 6.0.0\"",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/frkl.explain-0.1.dev28+g5ab25c6.dist-info/LICENSE",
    "LicenseText": "The Parity Public License 6.0.0\n\nContributor: Markus Binsteiner\n\nSource Code: https://gitlab.com/frkl/frkl.explain\n\n\nThis license lets you use and share this software for free, as\nlong as you contribute software you make with it. Specifically:\n\nIf you follow the rules below, you may do everything with this\nsoftware that would otherwise infringe either the contributor's\ncopyright in it, any patent claim the contributor can license,\nor both.\n\n1. Contribute changes and additions you make to this software.\n\n2. If you combine this software with other software, contribute\n   that other software.\n\n3. Contribute software you develop, deploy, monitor, or run with\n   this software.\n\n4. Ensure everyone who gets a copy of this software from you, in\n   source code or any other form, gets the text of this license\n   and the contributor and source code lines above.\n\n5. Do not make any legal claim against anyone accusing this\n   software, with or without changes, alone or with other\n   software, of infringing any patent claim.\n\nTo contribute software, publish all its source code, in the\npreferred form for making changes, through a freely accessible\ndistribution system widely used for similar source code, and\nlicense contributions not already licensed to the public on terms\nas permissive as this license accordingly.\n\nYou are excused for unknowingly breaking 1, 2, or 3 if you\ncontribute as required, or stop doing anything requiring this\nlicense, within 30 days of learning you broke the rule.\n\n**As far as the law allows, this software comes as is, without\nany warranty, and the contributor will not be liable to anyone\nfor any damages related to this software or this license, for any\nkind of legal claim.**\n",
    "Name": "frkl.explain",
    "URL": "https://gitlab.com/frkl/frkl_explain",
    "Version": "0.1.dev28+g5ab25c6"
  },
  {
    "Author": "Tom Christie",
    "Description": "The next generation HTTP client.",
    "License": "BSD License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/frkl.httpx-0.14.0.dist-info/LICENSE.md",
    "LicenseText": "Copyright © 2019, [Encode OSS Ltd](https://www.encode.io/).\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n* Redistributions of source code must retain the above copyright notice, this\n  list of conditions and the following disclaimer.\n\n* Redistributions in binary form must reproduce the above copyright notice,\n  this list of conditions and the following disclaimer in the documentation\n  and/or other materials provided with the distribution.\n\n* Neither the name of the copyright holder nor the names of its\n  contributors may be used to endorse or promote products derived from\n  this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\nCAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n",
    "Name": "frkl.httpx",
    "URL": "https://github.com/encode/httpx",
    "Version": "0.14.0"
  },
  {
    "Author": "Anton Romanovich, Markus Binsteiner",
    "Description": "Type inference for Jinja2 templates",
    "License": "BSD License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/frkl.jinja2schema-0.1.6.dev9+gac723cb.dist-info/LICENSE",
    "LicenseText": "The Parity Public License 6.0.0\n\nContributor: Markus Binsteiner\n\nSource Code: https://gitlab.com/frkl/frkl.jinja2schema\n\n\nThis license lets you use and share this software for free, as\nlong as you contribute software you make with it. Specifically:\n\nIf you follow the rules below, you may do everything with this\nsoftware that would otherwise infringe either the contributor's\ncopyright in it, any patent claim the contributor can license,\nor both.\n\n1. Contribute changes and additions you make to this software.\n\n2. If you combine this software with other software, contribute\n   that other software.\n\n3. Contribute software you develop, deploy, monitor, or run with\n   this software.\n\n4. Ensure everyone who gets a copy of this software from you, in\n   source code or any other form, gets the text of this license\n   and the contributor and source code lines above.\n\n5. Do not make any legal claim against anyone accusing this\n   software, with or without changes, alone or with other\n   software, of infringing any patent claim.\n\nTo contribute software, publish all its source code, in the\npreferred form for making changes, through a freely accessible\ndistribution system widely used for similar source code, and\nlicense contributions not already licensed to the public on terms\nas permissive as this license accordingly.\n\nYou are excused for unknowingly breaking 1, 2, or 3 if you\ncontribute as required, or stop doing anything requiring this\nlicense, within 30 days of learning you broke the rule.\n\n**As far as the law allows, this software comes as is, without\nany warranty, and the contributor will not be liable to anyone\nfor any damages related to this software or this license, for any\nkind of legal claim.**\n",
    "Name": "frkl.jinja2schema",
    "URL": "https://gitlab.com/frkl/jinja2schema",
    "Version": "0.1.6.dev9+gac723cb"
  },
  {
    "Author": "Markus Binsteiner",
    "Description": "Project artefact helper.",
    "License": "\"The Parity Public License 6.0.0\"",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/frkl.project_meta-0.1.dev41+g9da2294.dist-info/LICENSE",
    "LicenseText": "The Parity Public License 6.0.0\n\nContributor: Markus Binsteiner\n\nSource Code: https://gitlab.com/frkl/frkl.project_meta\n\n\nThis license lets you use and share this software for free, as\nlong as you contribute software you make with it. Specifically:\n\nIf you follow the rules below, you may do everything with this\nsoftware that would otherwise infringe either the contributor's\ncopyright in it, any patent claim the contributor can license,\nor both.\n\n1. Contribute changes and additions you make to this software.\n\n2. If you combine this software with other software, contribute\n   that other software.\n\n3. Contribute software you develop, deploy, monitor, or run with\n   this software.\n\n4. Ensure everyone who gets a copy of this software from you, in\n   source code or any other form, gets the text of this license\n   and the contributor and source code lines above.\n\n5. Do not make any legal claim against anyone accusing this\n   software, with or without changes, alone or with other\n   software, of infringing any patent claim.\n\nTo contribute software, publish all its source code, in the\npreferred form for making changes, through a freely accessible\ndistribution system widely used for similar source code, and\nlicense contributions not already licensed to the public on terms\nas permissive as this license accordingly.\n\nYou are excused for unknowingly breaking 1, 2, or 3 if you\ncontribute as required, or stop doing anything requiring this\nlicense, within 30 days of learning you broke the rule.\n\n**As far as the law allows, this software comes as is, without\nany warranty, and the contributor will not be liable to anyone\nfor any damages related to this software or this license, for any\nkind of legal claim.**\n",
    "Name": "frkl.project-meta",
    "URL": "https://gitlab.com/frkl/frkl_project_meta",
    "Version": "0.1.dev41+g9da2294"
  },
  {
    "Author": "Markus Binsteiner",
    "Description": "Library to manage abstract target classes.",
    "License": "\"The Parity Public License 6.0.0\"",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/frkl.targets-0.1.dev12+g475de2a.dist-info/LICENSE",
    "LicenseText": "The Parity Public License 6.0.0\n\nContributor: Markus Binsteiner\n\nSource Code: https://gitlab.com/frkl/frkl.targets\n\n\nThis license lets you use and share this software for free, as\nlong as you contribute software you make with it. Specifically:\n\nIf you follow the rules below, you may do everything with this\nsoftware that would otherwise infringe either the contributor's\ncopyright in it, any patent claim the contributor can license,\nor both.\n\n1. Contribute changes and additions you make to this software.\n\n2. If you combine this software with other software, contribute\n   that other software.\n\n3. Contribute software you develop, deploy, monitor, or run with\n   this software.\n\n4. Ensure everyone who gets a copy of this software from you, in\n   source code or any other form, gets the text of this license\n   and the contributor and source code lines above.\n\n5. Do not make any legal claim against anyone accusing this\n   software, with or without changes, alone or with other\n   software, of infringing any patent claim.\n\nTo contribute software, publish all its source code, in the\npreferred form for making changes, through a freely accessible\ndistribution system widely used for similar source code, and\nlicense contributions not already licensed to the public on terms\nas permissive as this license accordingly.\n\nYou are excused for unknowingly breaking 1, 2, or 3 if you\ncontribute as required, or stop doing anything requiring this\nlicense, within 30 days of learning you broke the rule.\n\n**As far as the law allows, this software comes as is, without\nany warranty, and the contributor will not be liable to anyone\nfor any damages related to this software or this license, for any\nkind of legal claim.**\n",
    "Name": "frkl.targets",
    "URL": "https://gitlab.com/frkl/frkl_targets",
    "Version": "0.1.dev12+g475de2a"
  },
  {
    "Author": "Markus Binsteiner",
    "Description": "Small utility framework to manage Python tasks, incl. metadata.",
    "License": "\"The Parity Public License 6.0.0\"",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/frkl.tasks-0.1.dev26+g0f3a31a.dist-info/LICENSE",
    "LicenseText": "The Parity Public License 6.0.0\n\nContributor: Markus Binsteiner\n\nSource Code: https://gitlab.com/frkl/frkl.tasks\n\n\nThis license lets you use and share this software for free, as\nlong as you contribute software you make with it. Specifically:\n\nIf you follow the rules below, you may do everything with this\nsoftware that would otherwise infringe either the contributor's\ncopyright in it, any patent claim the contributor can license,\nor both.\n\n1. Contribute changes and additions you make to this software.\n\n2. If you combine this software with other software, contribute\n   that other software.\n\n3. Contribute software you develop, deploy, monitor, or run with\n   this software.\n\n4. Ensure everyone who gets a copy of this software from you, in\n   source code or any other form, gets the text of this license\n   and the contributor and source code lines above.\n\n5. Do not make any legal claim against anyone accusing this\n   software, with or without changes, alone or with other\n   software, of infringing any patent claim.\n\nTo contribute software, publish all its source code, in the\npreferred form for making changes, through a freely accessible\ndistribution system widely used for similar source code, and\nlicense contributions not already licensed to the public on terms\nas permissive as this license accordingly.\n\nYou are excused for unknowingly breaking 1, 2, or 3 if you\ncontribute as required, or stop doing anything requiring this\nlicense, within 30 days of learning you broke the rule.\n\n**As far as the law allows, this software comes as is, without\nany warranty, and the contributor will not be liable to anyone\nfor any damages related to this software or this license, for any\nkind of legal claim.**\n",
    "Name": "frkl.tasks",
    "URL": "https://gitlab.com/frkl/frkl_tasks",
    "Version": "0.1.dev26+g0f3a31a"
  },
  {
    "Author": "Markus Binsteiner",
    "Description": "Types & arg helpers.",
    "License": "\"The Parity Public License 6.0.0\"",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/frkl.types-0.1.dev17+gea92fa7.dist-info/LICENSE",
    "LicenseText": "The Parity Public License 6.0.0\n\nContributor: Markus Binsteiner\n\nSource Code: https://gitlab.com/frkl/frkl.types\n\n\nThis license lets you use and share this software for free, as\nlong as you contribute software you make with it. Specifically:\n\nIf you follow the rules below, you may do everything with this\nsoftware that would otherwise infringe either the contributor's\ncopyright in it, any patent claim the contributor can license,\nor both.\n\n1. Contribute changes and additions you make to this software.\n\n2. If you combine this software with other software, contribute\n   that other software.\n\n3. Contribute software you develop, deploy, monitor, or run with\n   this software.\n\n4. Ensure everyone who gets a copy of this software from you, in\n   source code or any other form, gets the text of this license\n   and the contributor and source code lines above.\n\n5. Do not make any legal claim against anyone accusing this\n   software, with or without changes, alone or with other\n   software, of infringing any patent claim.\n\nTo contribute software, publish all its source code, in the\npreferred form for making changes, through a freely accessible\ndistribution system widely used for similar source code, and\nlicense contributions not already licensed to the public on terms\nas permissive as this license accordingly.\n\nYou are excused for unknowingly breaking 1, 2, or 3 if you\ncontribute as required, or stop doing anything requiring this\nlicense, within 30 days of learning you broke the rule.\n\n**As far as the law allows, this software comes as is, without\nany warranty, and the contributor will not be liable to anyone\nfor any damages related to this software or this license, for any\nkind of legal claim.**\n",
    "Name": "frkl.types",
    "URL": "https://gitlab.com/frkl/frkl_types",
    "Version": "0.1.dev17+gea92fa7"
  },
  {
    "Author": "Ed Schofield",
    "Description": "Clean single-source support for Python 3 and 2",
    "License": "MIT License",
    "LicenseFile": "UNKNOWN",
    "LicenseText": "UNKNOWN",
    "Name": "future",
    "URL": "https://python-future.org",
    "Version": "0.18.2"
  },
  {
    "Author": "Brett Cannon",
    "Description": "An async GitHub API library",
    "License": "Apache Software License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/gidgethub-4.1.1.dist-info/LICENSE",
    "LicenseText": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"{}\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright 2017 Brett Cannon\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n",
    "Name": "gidgethub",
    "URL": "UNKNOWN",
    "Version": "4.1.1"
  },
  {
    "Author": "Benjamin Bertrand",
    "Description": "An async GitLab API library",
    "License": "Apache Software License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/gidgetlab-0.6.0.dist-info/LICENSE",
    "LicenseText": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"{}\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright 2017 Brett Cannon\n   Copyright 2018 Benjamin Bertrand\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n",
    "Name": "gidgetlab",
    "URL": "https://gitlab.com/beenje/gidgetlab",
    "Version": "0.6.0"
  },
  {
    "Author": "Sebastian Thiel",
    "Description": "Git Object Database",
    "License": "BSD License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/gitdb-4.0.5.dist-info/LICENSE",
    "LicenseText": "Copyright (C) 2010, 2011 Sebastian Thiel and contributors\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without \nmodification, are permitted provided that the following conditions \nare met:\n\n* Redistributions of source code must retain the above copyright \nnotice, this list of conditions and the following disclaimer.\n\n* Redistributions in binary form must reproduce the above copyright \nnotice, this list of conditions and the following disclaimer in the \ndocumentation and/or other materials provided with the distribution.\n\n* Neither the name of the GitDB project nor the names of \nits contributors may be used to endorse or promote products derived \nfrom this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT \nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR \nA PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT \nOWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, \nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED \nTO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR \nPROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF \nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING \nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS \nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n\nAdditional Licenses\n-------------------\nThe files at \ngitdb/test/fixtures/packs/pack-11fdfa9e156ab73caae3b6da867192221f2089c2.idx\nand \ngitdb/test/fixtures/packs/pack-11fdfa9e156ab73caae3b6da867192221f2089c2.pack \nare licensed under GNU GPL as part of the git source repository, \nsee http://en.wikipedia.org/wiki/Git_%28software%29 for more information.\n\nThey are not required for the actual operation, which is why they are not found \nin the distribution package.\n",
    "Name": "gitdb",
    "URL": "https://github.com/gitpython-developers/gitdb",
    "Version": "4.0.5"
  },
  {
    "Author": "Nathaniel J. Smith",
    "Description": "A pure-Python, bring-your-own-I/O implementation of HTTP/1.1",
    "License": "MIT License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/h11-0.9.0.dist-info/LICENSE.txt",
    "LicenseText": "The MIT License (MIT)\n\nCopyright (c) 2016 Nathaniel J. Smith <njs@pobox.com> and other contributors\n\nPermission is hereby granted, free of charge, to any person obtaining\na copy of this software and associated documentation files (the\n\"Software\"), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, sublicense, and/or sell copies of the Software, and to\npermit persons to whom the Software is furnished to do so, subject to\nthe following conditions:\n\nThe above copyright notice and this permission notice shall be\nincluded in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\nNONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE\nLIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION\nOF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION\nWITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n",
    "Name": "h11",
    "URL": "https://github.com/python-hyper/h11",
    "Version": "0.9.0"
  },
  {
    "Author": "Tom Christie",
    "Description": "A minimal low-level HTTP client.",
    "License": "BSD License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/httpcore-0.10.1.dist-info/LICENSE.md",
    "LicenseText": "Copyright © 2020, [Encode OSS Ltd](https://www.encode.io/).\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n* Redistributions of source code must retain the above copyright notice, this\n  list of conditions and the following disclaimer.\n\n* Redistributions in binary form must reproduce the above copyright notice,\n  this list of conditions and the following disclaimer in the documentation\n  and/or other materials provided with the distribution.\n\n* Neither the name of the copyright holder nor the names of its\n  contributors may be used to endorse or promote products derived from\n  this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\nCAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n",
    "Name": "httpcore",
    "URL": "https://github.com/encode/httpcore",
    "Version": "0.10.1"
  },
  {
    "Author": "Kim Davies",
    "Description": "Internationalized Domain Names in Applications (IDNA)",
    "License": "BSD License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/idna-2.10.dist-info/LICENSE.rst",
    "LicenseText": "License\n-------\n\nLicense: bsd-3-clause\n\nCopyright (c) 2013-2020, Kim Davies. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n#. Redistributions of source code must retain the above copyright\n   notice, this list of conditions and the following disclaimer.\n\n#. Redistributions in binary form must reproduce the above\n   copyright notice, this list of conditions and the following\n   disclaimer in the documentation and/or other materials provided with\n   the distribution.\n\n#. Neither the name of the copyright holder nor the names of the \n   contributors may be used to endorse or promote products derived \n   from this software without specific prior written permission.\n\n#. THIS SOFTWARE IS PROVIDED BY THE CONTRIBUTORS \"AS IS\" AND ANY\n   EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n   IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\n   PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDERS OR \n   CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, \n   SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT \n   LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n   DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\n   THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n   (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE\n   USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH\n   DAMAGE.\n",
    "Name": "idna",
    "URL": "https://github.com/kjd/idna",
    "Version": "2.10"
  },
  {
    "Author": "Janne Vanhala",
    "Description": "A port of Ruby on Rails inflector to Python",
    "License": "MIT License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/inflection-0.5.0.dist-info/LICENSE",
    "LicenseText": "Copyright (C) 2012-2020 Janne Vanhala\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n",
    "Name": "inflection",
    "URL": "https://github.com/jpvanhal/inflection",
    "Version": "0.5.0"
  },
  {
    "Author": "Andrew Svetlov",
    "Description": "Mixed sync-async queue to interoperate between asyncio tasks and classic threads",
    "License": "Apache Software License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/janus-0.5.0.dist-info/LICENSE",
    "LicenseText": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"{}\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright 2015-2018 Andrew Svetlov and aio-libs team\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n\n",
    "Name": "janus",
    "URL": "https://github.com/aio-libs/janus/",
    "Version": "0.5.0"
  },
  {
    "Author": "Terry Yin",
    "Description": "A code analyzer without caring the C/C++ header files. It works with Java, C/C++, JavaScript, Python, Ruby, Swift, Objective C. Metrics includes cyclomatic complexity number etc.",
    "License": "Freeware",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/lizard-1.17.4.dist-info/LICENSE.txt",
    "LicenseText": "Copyright Terry Yin and other contributors\n\nThis software consists of voluntary contributions made by many\nindividuals. For exact contribution history, see the revision history.\n\nThe following license applies to all parts of this software except as\ndocumented below:\n\n====\n\nPermission is hereby granted, free of charge, to any person obtaining\na copy of this software and associated documentation files (the\n\"Software\"), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, sublicense, and/or sell copies of the Software, and to\npermit persons to whom the Software is furnished to do so, subject to\nthe following conditions:\n\nThe above copyright notice and this permission notice shall be\nincluded in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\nNONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE\nLIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION\nOF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION\nWITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n====\n",
    "Name": "lizard",
    "URL": "http://www.lizard.ws",
    "Version": "1.17.4"
  },
  {
    "Author": "Chris Hager",
    "Description": "Robust and effective logging for Python 2 and 3",
    "License": "MIT License",
    "LicenseFile": "UNKNOWN",
    "LicenseText": "UNKNOWN",
    "Name": "logzero",
    "URL": "https://github.com/metachris/logzero",
    "Version": "1.5.0"
  },
  {
    "Author": "Hajime Senuma",
    "Description": "Python wrapper for MurmurHash (MurmurHash3), a set of fast and robust hash functions.",
    "License": "CC0 1.0 Universal (CC0 1.0) Public Domain Dedication",
    "LicenseFile": "UNKNOWN",
    "LicenseText": "UNKNOWN",
    "Name": "mmh3",
    "URL": "http://packages.python.org/mmh3",
    "Version": "2.5.1"
  },
  {
    "Author": "UNKNOWN",
    "Description": "A set that remembers its order, and allows looking up its items by their index in that order.",
    "License": "MIT License",
    "LicenseFile": "UNKNOWN",
    "LicenseText": "UNKNOWN",
    "Name": "ordered-set",
    "URL": "https://github.com/LuminosoInsight/ordered-set",
    "Version": "4.0.2"
  },
  {
    "Author": "Eli Collins",
    "Description": "comprehensive password hashing framework supporting over 30 schemes",
    "License": "BSD",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/passlib-1.7.2.dist-info/LICENSE",
    "LicenseText": ".. -*- restructuredtext -*-\n\n=====================\nCopyrights & Licenses\n=====================\n\nCredits\n=======\nPasslib is primarily developed by Eli Collins.\n\nSpecial thanks to Darin Gordon for testing and\nfeedback on the :mod:`passlib.totp` module.\n\nLicense for Passlib\n===================\nPasslib is (c) `Assurance Technologies <http://www.assurancetechnologies.com>`_,\nand is released under the `BSD license <http://www.opensource.org/licenses/bsd-license.php>`_::\n\n    Passlib\n    Copyright (c) 2008-2019 Assurance Technologies, LLC.\n    All rights reserved.\n\n    Redistribution and use in source and binary forms, with or without\n    modification, are permitted provided that the following conditions are\n    met:\n\n    * Redistributions of source code must retain the above copyright\n      notice, this list of conditions and the following disclaimer.\n\n    * Redistributions in binary form must reproduce the above copyright\n      notice, this list of conditions and the following disclaimer in the\n      documentation and/or other materials provided with the distribution.\n\n    * Neither the name of Assurance Technologies, nor the names of the\n      contributors may be used to endorse or promote products derived\n      from this software without specific prior written permission.\n\n    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n    \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n    LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\n    A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\n    OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\n    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\n    LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n    DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\n    THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n    (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nLicenses for incorporated software\n==================================\nPasslib contains some code derived from the following sources:\n\nMD5-Crypt\n---------\nThe source file ``passlib/handlers/md5_crypt.py`` contains code derived from the original\n`FreeBSD md5-crypt implementation <http://www.freebsd.org/cgi/cvsweb.cgi/~checkout~/src/lib/libcrypt/crypt.c?rev=1.2>`_,\nwhich is available under the following license::\n\n    \"THE BEER-WARE LICENSE\" (Revision 42):\n    <phk@login.dknet.dk> wrote this file.  As long as you retain this notice you\n    can do whatever you want with this stuff. If we meet some day, and you think\n    this stuff is worth it, you can buy me a beer in return.   Poul-Henning Kamp\n\n    converted to python May 2008\n    by Eli Collins\n\nDES\n---\nThe source file ``passlib/crypto/des.py`` contains code derived from\n`UnixCrypt.java <http://www.dynamic.net.au/christos/crypt/UnixCrypt2.txt>`_,\na pure-java implementation of the historic unix-crypt password hash algorithm.\nIt is available under the following license::\n\n    UnixCrypt.java 0.9 96/11/25\n    Copyright (c) 1996 Aki Yoshida. All rights reserved.\n    Permission to use, copy, modify and distribute this software\n    for non-commercial or commercial purposes and without fee is\n    hereby granted provided that this copyright notice appears in\n    all copies.\n\n    modified April 2001\n    by Iris Van den Broeke, Daniel Deville\n\n    modified Aug 2005\n    by Greg Wilkins (gregw)\n\n    converted to python Jun 2009\n    by Eli Collins\n\njBCrypt\n-------\nThe source file ``passlib/crypto/_blowfish/base.py`` contains code derived\nfrom `jBcrypt 0.2 <http://www.mindrot.org/projects/jBCrypt/>`_, a Java\nimplementation of the BCrypt password hash algorithm. It is available under\na BSD/ISC license::\n\n    Copyright (c) 2006 Damien Miller <djm@mindrot.org>\n\n    Permission to use, copy, modify, and distribute this software for any\n    purpose with or without fee is hereby granted, provided that the above\n    copyright notice and this permission notice appear in all copies.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\" AND THE AUTHOR DISCLAIMS ALL WARRANTIES\n    WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF\n    MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR\n    ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES\n    WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN\n    ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTUOUS ACTION, ARISING OUT OF\n    OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.\n\nWordsets\n--------\nThe EFF wordsets in ``passlib/_data/wordsets`` are (c) 2016 the Electronic Freedom Foundation.\nThey were downloaded from `<https://www.eff.org/deeplinks/2016/07/new-wordlists-random-passphrases>`_,\nand are released under the `Creative Commons License <https://www.eff.org/copyright>`_.\n",
    "Name": "passlib",
    "URL": "https://bitbucket.org/ecollins/passlib",
    "Version": "1.7.2"
  },
  {
    "Author": "Caleb P. Burns",
    "Description": "Utility library for gitignore style pattern matching of file paths.",
    "License": "Mozilla Public License 2.0 (MPL 2.0)",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/pathspec-0.8.0.dist-info/LICENSE",
    "LicenseText": "Mozilla Public License Version 2.0\n==================================\n\n1. Definitions\n--------------\n\n1.1. \"Contributor\"\n    means each individual or legal entity that creates, contributes to\n    the creation of, or owns Covered Software.\n\n1.2. \"Contributor Version\"\n    means the combination of the Contributions of others (if any) used\n    by a Contributor and that particular Contributor's Contribution.\n\n1.3. \"Contribution\"\n    means Covered Software of a particular Contributor.\n\n1.4. \"Covered Software\"\n    means Source Code Form to which the initial Contributor has attached\n    the notice in Exhibit A, the Executable Form of such Source Code\n    Form, and Modifications of such Source Code Form, in each case\n    including portions thereof.\n\n1.5. \"Incompatible With Secondary Licenses\"\n    means\n\n    (a) that the initial Contributor has attached the notice described\n        in Exhibit B to the Covered Software; or\n\n    (b) that the Covered Software was made available under the terms of\n        version 1.1 or earlier of the License, but not also under the\n        terms of a Secondary License.\n\n1.6. \"Executable Form\"\n    means any form of the work other than Source Code Form.\n\n1.7. \"Larger Work\"\n    means a work that combines Covered Software with other material, in \n    a separate file or files, that is not Covered Software.\n\n1.8. \"License\"\n    means this document.\n\n1.9. \"Licensable\"\n    means having the right to grant, to the maximum extent possible,\n    whether at the time of the initial grant or subsequently, any and\n    all of the rights conveyed by this License.\n\n1.10. \"Modifications\"\n    means any of the following:\n\n    (a) any file in Source Code Form that results from an addition to,\n        deletion from, or modification of the contents of Covered\n        Software; or\n\n    (b) any new file in Source Code Form that contains any Covered\n        Software.\n\n1.11. \"Patent Claims\" of a Contributor\n    means any patent claim(s), including without limitation, method,\n    process, and apparatus claims, in any patent Licensable by such\n    Contributor that would be infringed, but for the grant of the\n    License, by the making, using, selling, offering for sale, having\n    made, import, or transfer of either its Contributions or its\n    Contributor Version.\n\n1.12. \"Secondary License\"\n    means either the GNU General Public License, Version 2.0, the GNU\n    Lesser General Public License, Version 2.1, the GNU Affero General\n    Public License, Version 3.0, or any later versions of those\n    licenses.\n\n1.13. \"Source Code Form\"\n    means the form of the work preferred for making modifications.\n\n1.14. \"You\" (or \"Your\")\n    means an individual or a legal entity exercising rights under this\n    License. For legal entities, \"You\" includes any entity that\n    controls, is controlled by, or is under common control with You. For\n    purposes of this definition, \"control\" means (a) the power, direct\n    or indirect, to cause the direction or management of such entity,\n    whether by contract or otherwise, or (b) ownership of more than\n    fifty percent (50%) of the outstanding shares or beneficial\n    ownership of such entity.\n\n2. License Grants and Conditions\n--------------------------------\n\n2.1. Grants\n\nEach Contributor hereby grants You a world-wide, royalty-free,\nnon-exclusive license:\n\n(a) under intellectual property rights (other than patent or trademark)\n    Licensable by such Contributor to use, reproduce, make available,\n    modify, display, perform, distribute, and otherwise exploit its\n    Contributions, either on an unmodified basis, with Modifications, or\n    as part of a Larger Work; and\n\n(b) under Patent Claims of such Contributor to make, use, sell, offer\n    for sale, have made, import, and otherwise transfer either its\n    Contributions or its Contributor Version.\n\n2.2. Effective Date\n\nThe licenses granted in Section 2.1 with respect to any Contribution\nbecome effective for each Contribution on the date the Contributor first\ndistributes such Contribution.\n\n2.3. Limitations on Grant Scope\n\nThe licenses granted in this Section 2 are the only rights granted under\nthis License. No additional rights or licenses will be implied from the\ndistribution or licensing of Covered Software under this License.\nNotwithstanding Section 2.1(b) above, no patent license is granted by a\nContributor:\n\n(a) for any code that a Contributor has removed from Covered Software;\n    or\n\n(b) for infringements caused by: (i) Your and any other third party's\n    modifications of Covered Software, or (ii) the combination of its\n    Contributions with other software (except as part of its Contributor\n    Version); or\n\n(c) under Patent Claims infringed by Covered Software in the absence of\n    its Contributions.\n\nThis License does not grant any rights in the trademarks, service marks,\nor logos of any Contributor (except as may be necessary to comply with\nthe notice requirements in Section 3.4).\n\n2.4. Subsequent Licenses\n\nNo Contributor makes additional grants as a result of Your choice to\ndistribute the Covered Software under a subsequent version of this\nLicense (see Section 10.2) or under the terms of a Secondary License (if\npermitted under the terms of Section 3.3).\n\n2.5. Representation\n\nEach Contributor represents that the Contributor believes its\nContributions are its original creation(s) or it has sufficient rights\nto grant the rights to its Contributions conveyed by this License.\n\n2.6. Fair Use\n\nThis License is not intended to limit any rights You have under\napplicable copyright doctrines of fair use, fair dealing, or other\nequivalents.\n\n2.7. Conditions\n\nSections 3.1, 3.2, 3.3, and 3.4 are conditions of the licenses granted\nin Section 2.1.\n\n3. Responsibilities\n-------------------\n\n3.1. Distribution of Source Form\n\nAll distribution of Covered Software in Source Code Form, including any\nModifications that You create or to which You contribute, must be under\nthe terms of this License. You must inform recipients that the Source\nCode Form of the Covered Software is governed by the terms of this\nLicense, and how they can obtain a copy of this License. You may not\nattempt to alter or restrict the recipients' rights in the Source Code\nForm.\n\n3.2. Distribution of Executable Form\n\nIf You distribute Covered Software in Executable Form then:\n\n(a) such Covered Software must also be made available in Source Code\n    Form, as described in Section 3.1, and You must inform recipients of\n    the Executable Form how they can obtain a copy of such Source Code\n    Form by reasonable means in a timely manner, at a charge no more\n    than the cost of distribution to the recipient; and\n\n(b) You may distribute such Executable Form under the terms of this\n    License, or sublicense it under different terms, provided that the\n    license for the Executable Form does not attempt to limit or alter\n    the recipients' rights in the Source Code Form under this License.\n\n3.3. Distribution of a Larger Work\n\nYou may create and distribute a Larger Work under terms of Your choice,\nprovided that You also comply with the requirements of this License for\nthe Covered Software. If the Larger Work is a combination of Covered\nSoftware with a work governed by one or more Secondary Licenses, and the\nCovered Software is not Incompatible With Secondary Licenses, this\nLicense permits You to additionally distribute such Covered Software\nunder the terms of such Secondary License(s), so that the recipient of\nthe Larger Work may, at their option, further distribute the Covered\nSoftware under the terms of either this License or such Secondary\nLicense(s).\n\n3.4. Notices\n\nYou may not remove or alter the substance of any license notices\n(including copyright notices, patent notices, disclaimers of warranty,\nor limitations of liability) contained within the Source Code Form of\nthe Covered Software, except that You may alter any license notices to\nthe extent required to remedy known factual inaccuracies.\n\n3.5. Application of Additional Terms\n\nYou may choose to offer, and to charge a fee for, warranty, support,\nindemnity or liability obligations to one or more recipients of Covered\nSoftware. However, You may do so only on Your own behalf, and not on\nbehalf of any Contributor. You must make it absolutely clear that any\nsuch warranty, support, indemnity, or liability obligation is offered by\nYou alone, and You hereby agree to indemnify every Contributor for any\nliability incurred by such Contributor as a result of warranty, support,\nindemnity or liability terms You offer. You may include additional\ndisclaimers of warranty and limitations of liability specific to any\njurisdiction.\n\n4. Inability to Comply Due to Statute or Regulation\n---------------------------------------------------\n\nIf it is impossible for You to comply with any of the terms of this\nLicense with respect to some or all of the Covered Software due to\nstatute, judicial order, or regulation then You must: (a) comply with\nthe terms of this License to the maximum extent possible; and (b)\ndescribe the limitations and the code they affect. Such description must\nbe placed in a text file included with all distributions of the Covered\nSoftware under this License. Except to the extent prohibited by statute\nor regulation, such description must be sufficiently detailed for a\nrecipient of ordinary skill to be able to understand it.\n\n5. Termination\n--------------\n\n5.1. The rights granted under this License will terminate automatically\nif You fail to comply with any of its terms. However, if You become\ncompliant, then the rights granted under this License from a particular\nContributor are reinstated (a) provisionally, unless and until such\nContributor explicitly and finally terminates Your grants, and (b) on an\nongoing basis, if such Contributor fails to notify You of the\nnon-compliance by some reasonable means prior to 60 days after You have\ncome back into compliance. Moreover, Your grants from a particular\nContributor are reinstated on an ongoing basis if such Contributor\nnotifies You of the non-compliance by some reasonable means, this is the\nfirst time You have received notice of non-compliance with this License\nfrom such Contributor, and You become compliant prior to 30 days after\nYour receipt of the notice.\n\n5.2. If You initiate litigation against any entity by asserting a patent\ninfringement claim (excluding declaratory judgment actions,\ncounter-claims, and cross-claims) alleging that a Contributor Version\ndirectly or indirectly infringes any patent, then the rights granted to\nYou by any and all Contributors for the Covered Software under Section\n2.1 of this License shall terminate.\n\n5.3. In the event of termination under Sections 5.1 or 5.2 above, all\nend user license agreements (excluding distributors and resellers) which\nhave been validly granted by You or Your distributors under this License\nprior to termination shall survive termination.\n\n************************************************************************\n*                                                                      *\n*  6. Disclaimer of Warranty                                           *\n*  -------------------------                                           *\n*                                                                      *\n*  Covered Software is provided under this License on an \"as is\"       *\n*  basis, without warranty of any kind, either expressed, implied, or  *\n*  statutory, including, without limitation, warranties that the       *\n*  Covered Software is free of defects, merchantable, fit for a        *\n*  particular purpose or non-infringing. The entire risk as to the     *\n*  quality and performance of the Covered Software is with You.        *\n*  Should any Covered Software prove defective in any respect, You     *\n*  (not any Contributor) assume the cost of any necessary servicing,   *\n*  repair, or correction. This disclaimer of warranty constitutes an   *\n*  essential part of this License. No use of any Covered Software is   *\n*  authorized under this License except under this disclaimer.         *\n*                                                                      *\n************************************************************************\n\n************************************************************************\n*                                                                      *\n*  7. Limitation of Liability                                          *\n*  --------------------------                                          *\n*                                                                      *\n*  Under no circumstances and under no legal theory, whether tort      *\n*  (including negligence), contract, or otherwise, shall any           *\n*  Contributor, or anyone who distributes Covered Software as          *\n*  permitted above, be liable to You for any direct, indirect,         *\n*  special, incidental, or consequential damages of any character      *\n*  including, without limitation, damages for lost profits, loss of    *\n*  goodwill, work stoppage, computer failure or malfunction, or any    *\n*  and all other commercial damages or losses, even if such party      *\n*  shall have been informed of the possibility of such damages. This   *\n*  limitation of liability shall not apply to liability for death or   *\n*  personal injury resulting from such party's negligence to the       *\n*  extent applicable law prohibits such limitation. Some               *\n*  jurisdictions do not allow the exclusion or limitation of           *\n*  incidental or consequential damages, so this exclusion and          *\n*  limitation may not apply to You.                                    *\n*                                                                      *\n************************************************************************\n\n8. Litigation\n-------------\n\nAny litigation relating to this License may be brought only in the\ncourts of a jurisdiction where the defendant maintains its principal\nplace of business and such litigation shall be governed by laws of that\njurisdiction, without reference to its conflict-of-law provisions.\nNothing in this Section shall prevent a party's ability to bring\ncross-claims or counter-claims.\n\n9. Miscellaneous\n----------------\n\nThis License represents the complete agreement concerning the subject\nmatter hereof. If any provision of this License is held to be\nunenforceable, such provision shall be reformed only to the extent\nnecessary to make it enforceable. Any law or regulation which provides\nthat the language of a contract shall be construed against the drafter\nshall not be used to construe this License against a Contributor.\n\n10. Versions of the License\n---------------------------\n\n10.1. New Versions\n\nMozilla Foundation is the license steward. Except as provided in Section\n10.3, no one other than the license steward has the right to modify or\npublish new versions of this License. Each version will be given a\ndistinguishing version number.\n\n10.2. Effect of New Versions\n\nYou may distribute the Covered Software under the terms of the version\nof the License under which You originally received the Covered Software,\nor under the terms of any subsequent version published by the license\nsteward.\n\n10.3. Modified Versions\n\nIf you create software not governed by this License, and you want to\ncreate a new license for such software, you may create and use a\nmodified version of this License if you rename the license and remove\nany references to the name of the license steward (except to note that\nsuch modified license differs from this License).\n\n10.4. Distributing Source Code Form that is Incompatible With Secondary\nLicenses\n\nIf You choose to distribute Source Code Form that is Incompatible With\nSecondary Licenses under the terms of this version of the License, the\nnotice described in Exhibit B of this License must be attached.\n\nExhibit A - Source Code Form License Notice\n-------------------------------------------\n\n  This Source Code Form is subject to the terms of the Mozilla Public\n  License, v. 2.0. If a copy of the MPL was not distributed with this\n  file, You can obtain one at http://mozilla.org/MPL/2.0/.\n\nIf it is not possible or desirable to put the notice in a particular\nfile, then You may include the notice in a location (such as a LICENSE\nfile in a relevant directory) where a recipient would be likely to look\nfor such a notice.\n\nYou may add additional accurate notices of copyright ownership.\n\nExhibit B - \"Incompatible With Secondary Licenses\" Notice\n---------------------------------------------------------\n\n  This Source Code Form is \"Incompatible With Secondary Licenses\", as\n  defined by the Mozilla Public License, v. 2.0.\n",
    "Name": "pathspec",
    "URL": "https://github.com/cpburnz/python-path-specification",
    "Version": "0.8.0"
  },
  {
    "Author": "Eli Bendersky",
    "Description": "C parser in Python",
    "License": "BSD License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/pycparser-2.20.dist-info/LICENSE",
    "LicenseText": "pycparser -- A C parser in Python\n\nCopyright (c) 2008-2017, Eli Bendersky\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification,\nare permitted provided that the following conditions are met:\n\n* Redistributions of source code must retain the above copyright notice, this \n  list of conditions and the following disclaimer.\n* Redistributions in binary form must reproduce the above copyright notice, \n  this list of conditions and the following disclaimer in the documentation \n  and/or other materials provided with the distribution.\n* Neither the name of Eli Bendersky nor the names of its contributors may \n  be used to endorse or promote products derived from this software without \n  specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND \nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED \nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE \nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE \nLIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR \nCONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE \nGOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) \nHOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT \nLIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT \nOF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n",
    "Name": "pycparser",
    "URL": "https://github.com/eliben/pycparser",
    "Version": "2.20"
  },
  {
    "Author": "Gustavo Niemeyer",
    "Description": "Extensions to the standard Python datetime module",
    "License": "BSD License, Apache Software License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/python_dateutil-2.8.1.dist-info/LICENSE",
    "LicenseText": "Copyright 2017- Paul Ganssle <paul@ganssle.io>\nCopyright 2017- dateutil contributors (see AUTHORS file)\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n\nThe above license applies to all contributions after 2017-12-01, as well as\nall contributions that have been re-licensed (see AUTHORS file for the list of\ncontributors who have re-licensed their code).\n--------------------------------------------------------------------------------\ndateutil - Extensions to the standard Python datetime module.\n\nCopyright (c) 2003-2011 - Gustavo Niemeyer <gustavo@niemeyer.net>\nCopyright (c) 2012-2014 - Tomi Pieviläinen <tomi.pievilainen@iki.fi>\nCopyright (c) 2014-2016 - Yaron de Leeuw <me@jarondl.net>\nCopyright (c) 2015-     - Paul Ganssle <paul@ganssle.io>\nCopyright (c) 2015-     - dateutil contributors (see AUTHORS file)\n\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n    * Redistributions of source code must retain the above copyright notice,\n      this list of conditions and the following disclaimer.\n    * Redistributions in binary form must reproduce the above copyright notice,\n      this list of conditions and the following disclaimer in the documentation\n      and/or other materials provided with the distribution.\n    * Neither the name of the copyright holder nor the names of its\n      contributors may be used to endorse or promote products derived from\n      this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR\nCONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\nEXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\nPROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\nPROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nThe above BSD License Applies to all code, even that also covered by Apache 2.0.",
    "Name": "python-dateutil",
    "URL": "https://dateutil.readthedocs.io",
    "Version": "2.8.1"
  },
  {
    "Author": "Val Neekman",
    "Description": "A Python Slugify application that handles Unicode",
    "License": "MIT License",
    "LicenseFile": "UNKNOWN",
    "LicenseText": "UNKNOWN",
    "Name": "python-slugify",
    "URL": "https://github.com/un33k/python-slugify",
    "Version": "4.0.1"
  },
  {
    "Author": "Stuart Bishop",
    "Description": "World timezone definitions, modern and historical",
    "License": "MIT License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/pytz-2020.1.dist-info/LICENSE.txt",
    "LicenseText": "Copyright (c) 2003-2019 Stuart Bishop <stuart@stuartbishop.net>\n\nPermission is hereby granted, free of charge, to any person obtaining a\ncopy of this software and associated documentation files (the \"Software\"),\nto deal in the Software without restriction, including without limitation\nthe rights to use, copy, modify, merge, publish, distribute, sublicense,\nand/or sell copies of the Software, and to permit persons to whom the\nSoftware is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in\nall copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL\nTHE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\nFROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER\nDEALINGS IN THE SOFTWARE.\n",
    "Name": "pytz",
    "URL": "http://pythonhosted.org/pytz",
    "Version": "2020.1"
  },
  {
    "Author": "Matthew Barnett",
    "Description": "Alternative regular expression module, to replace re.",
    "License": "Python Software Foundation License",
    "LicenseFile": "UNKNOWN",
    "LicenseText": "UNKNOWN",
    "Name": "regex",
    "URL": "https://bitbucket.org/mrabarnett/mrab-regex",
    "Version": "2020.7.14"
  },
  {
    "Author": "Ian Stapleton Cordasco",
    "Description": "Validating URI References per RFC 3986",
    "License": "Apache Software License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/rfc3986-1.4.0.dist-info/LICENSE",
    "LicenseText": "Copyright 2014 Ian Cordasco, Rackspace\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n",
    "Name": "rfc3986",
    "URL": "http://rfc3986.readthedocs.io",
    "Version": "1.4.0"
  },
  {
    "Author": "Will McGugan",
    "Description": "Render rich text, tables, progress bars, syntax highlighting, markdown and more to the terminal",
    "License": "MIT License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/rich-5.1.1.dist-info/LICENSE",
    "LicenseText": "Copyright 2020 Will McGugan\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n",
    "Name": "rich",
    "URL": "https://github.com/willmcgugan/rich",
    "Version": "5.1.1"
  },
  {
    "Author": "Anthon van der Neut",
    "Description": "ruamel.yaml is a YAML parser/emitter that supports roundtrip preservation of comments, seq/map flow style, and map key order",
    "License": "MIT License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/ruamel.yaml-0.16.10.dist-info/LICENSE",
    "LicenseText": " The MIT License (MIT)\n\n Copyright (c) 2014-2020 Anthon van der Neut, Ruamel bvba\n\n Permission is hereby granted, free of charge, to any person obtaining a copy\n of this software and associated documentation files (the \"Software\"), to deal\n in the Software without restriction, including without limitation the rights\n to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n copies of the Software, and to permit persons to whom the Software is\n furnished to do so, subject to the following conditions:\n\n The above copyright notice and this permission notice shall be included in\n all copies or substantial portions of the Software.\n\n THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\n SOFTWARE.\n",
    "Name": "ruamel.yaml",
    "URL": "https://sourceforge.net/p/ruamel-yaml/code/ci/default/tree",
    "Version": "0.16.10"
  },
  {
    "Author": "Anthon van der Neut",
    "Description": "C version of reader, parser and emitter for ruamel.yaml derived from libyaml",
    "License": "MIT License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/ruamel.yaml.clib-0.2.0.dist-info/LICENSE.txt",
    "LicenseText": " The MIT License (MIT)\n\n Copyright (c) 2019 Anthon van der Neut, Ruamel bvba\n\n Permission is hereby granted, free of charge, to any person obtaining a copy\n of this software and associated documentation files (the \"Software\"), to deal\n in the Software without restriction, including without limitation the rights\n to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n copies of the Software, and to permit persons to whom the Software is\n furnished to do so, subject to the following conditions:\n\n The above copyright notice and this permission notice shall be included in\n all copies or substantial portions of the Software.\n\n THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\n SOFTWARE.\n",
    "Name": "ruamel.yaml.clib",
    "URL": "https://bitbucket.org/ruamel/yaml.clib",
    "Version": "0.2.0"
  },
  {
    "Author": "Benjamin Peterson",
    "Description": "Python 2 and 3 compatibility utilities",
    "License": "MIT License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/six-1.15.0.dist-info/LICENSE",
    "LicenseText": "Copyright (c) 2010-2020 Benjamin Peterson\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of\nthis software and associated documentation files (the \"Software\"), to deal in\nthe Software without restriction, including without limitation the rights to\nuse, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of\nthe Software, and to permit persons to whom the Software is furnished to do so,\nsubject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS\nFOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR\nCOPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER\nIN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN\nCONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n",
    "Name": "six",
    "URL": "https://github.com/benjaminp/six",
    "Version": "1.15.0"
  },
  {
    "Author": "Sebastian Thiel",
    "Description": "A pure Python implementation of a sliding window memory map manager",
    "License": "BSD License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/smmap-3.0.4.dist-info/LICENSE",
    "LicenseText": "Copyright (C) 2010, 2011 Sebastian Thiel and contributors\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without \nmodification, are permitted provided that the following conditions \nare met:\n\n* Redistributions of source code must retain the above copyright \nnotice, this list of conditions and the following disclaimer.\n\n* Redistributions in binary form must reproduce the above copyright \nnotice, this list of conditions and the following disclaimer in the \ndocumentation and/or other materials provided with the distribution.\n\n* Neither the name of the async project nor the names of \nits contributors may be used to endorse or promote products derived \nfrom this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT \nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR \nA PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT \nOWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, \nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED \nTO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR \nPROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF \nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING \nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS \nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n",
    "Name": "smmap",
    "URL": "https://github.com/gitpython-developers/smmap",
    "Version": "3.0.4"
  },
  {
    "Author": "Nathaniel J. Smith",
    "Description": "Sniff out which async library your code is running under",
    "License": "MIT License, Apache Software License",
    "LicenseFile": "UNKNOWN",
    "LicenseText": "UNKNOWN",
    "Name": "sniffio",
    "URL": "https://github.com/python-trio/sniffio",
    "Version": "1.1.0"
  },
  {
    "Author": "Grant Jenks",
    "Description": "Sorted Containers -- Sorted List, Sorted Dict, Sorted Set",
    "License": "Apache Software License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/sortedcontainers-2.2.2.dist-info/LICENSE",
    "LicenseText": "Copyright 2014-2019 Grant Jenks\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n",
    "Name": "sortedcontainers",
    "URL": "http://www.grantjenks.com/docs/sortedcontainers/",
    "Version": "2.2.2"
  },
  {
    "Author": "Sergey Astanin",
    "Description": "Pretty-print tabular data",
    "License": "MIT License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/tabulate-0.8.7.dist-info/LICENSE",
    "LicenseText": "Copyright (c) 2011-2020 Sergey Astanin and contributors\n\nPermission is hereby granted, free of charge, to any person obtaining\na copy of this software and associated documentation files (the\n\"Software\"), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, sublicense, and/or sell copies of the Software, and to\npermit persons to whom the Software is furnished to do so, subject to\nthe following conditions:\n\nThe above copyright notice and this permission notice shall be\nincluded in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\nNONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE\nLIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION\nOF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION\nWITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n",
    "Name": "tabulate",
    "URL": "https://github.com/astanin/python-tabulate",
    "Version": "0.8.7"
  },
  {
    "Author": "Mikhail Korobov",
    "Description": "The most basic Text::Unidecode port",
    "License": "Artistic License, GNU General Public License (GPL), GNU General Public License v2 or later (GPLv2+)",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/text_unidecode-1.3.dist-info/LICENSE.txt",
    "LicenseText": "text-unidecode is a free software; you can redistribute\nit and/or modify it under the terms of either:\n\n* GPL or GPLv2+ (see https://www.gnu.org/licenses/license-list.html#GNUGPL), or\n* Artistic License - see below:\n\n\n                         The \"Artistic License\"\n\n                                Preamble\n\nThe intent of this document is to state the conditions under which a\nPackage may be copied, such that the Copyright Holder maintains some\nsemblance of artistic control over the development of the package,\nwhile giving the users of the package the right to use and distribute\nthe Package in a more-or-less customary fashion, plus the right to make\nreasonable modifications.\n\nDefinitions:\n\n        \"Package\" refers to the collection of files distributed by the\n        Copyright Holder, and derivatives of that collection of files\n        created through textual modification.\n\n        \"Standard Version\" refers to such a Package if it has not been\n        modified, or has been modified in accordance with the wishes\n        of the Copyright Holder as specified below.\n\n        \"Copyright Holder\" is whoever is named in the copyright or\n        copyrights for the package.\n\n        \"You\" is you, if you're thinking about copying or distributing\n        this Package.\n\n        \"Reasonable copying fee\" is whatever you can justify on the\n        basis of media cost, duplication charges, time of people involved,\n        and so on.  (You will not be required to justify it to the\n        Copyright Holder, but only to the computing community at large\n        as a market that must bear the fee.)\n\n        \"Freely Available\" means that no fee is charged for the item\n        itself, though there may be fees involved in handling the item.\n        It also means that recipients of the item may redistribute it\n        under the same conditions they received it.\n\n1. You may make and give away verbatim copies of the source form of the\nStandard Version of this Package without restriction, provided that you\nduplicate all of the original copyright notices and associated disclaimers.\n\n2. You may apply bug fixes, portability fixes and other modifications\nderived from the Public Domain or from the Copyright Holder.  A Package\nmodified in such a way shall still be considered the Standard Version.\n\n3. You may otherwise modify your copy of this Package in any way, provided\nthat you insert a prominent notice in each changed file stating how and\nwhen you changed that file, and provided that you do at least ONE of the\nfollowing:\n\n    a) place your modifications in the Public Domain or otherwise make them\n    Freely Available, such as by posting said modifications to Usenet or\n    an equivalent medium, or placing the modifications on a major archive\n    site such as uunet.uu.net, or by allowing the Copyright Holder to include\n    your modifications in the Standard Version of the Package.\n\n    b) use the modified Package only within your corporation or organization.\n\n    c) rename any non-standard executables so the names do not conflict\n    with standard executables, which must also be provided, and provide\n    a separate manual page for each non-standard executable that clearly\n    documents how it differs from the Standard Version.\n\n    d) make other distribution arrangements with the Copyright Holder.\n\n4. You may distribute the programs of this Package in object code or\nexecutable form, provided that you do at least ONE of the following:\n\n    a) distribute a Standard Version of the executables and library files,\n    together with instructions (in the manual page or equivalent) on where\n    to get the Standard Version.\n\n    b) accompany the distribution with the machine-readable source of\n    the Package with your modifications.\n\n    c) give non-standard executables non-standard names, and clearly\n    document the differences in manual pages (or equivalent), together\n    with instructions on where to get the Standard Version.\n\n    d) make other distribution arrangements with the Copyright Holder.\n\n5. You may charge a reasonable copying fee for any distribution of this\nPackage.  You may charge any fee you choose for support of this\nPackage.  You may not charge a fee for this Package itself.  However,\nyou may distribute this Package in aggregate with other (possibly\ncommercial) programs as part of a larger (possibly commercial) software\ndistribution provided that you do not advertise this Package as a\nproduct of your own.  You may embed this Package's interpreter within\nan executable of yours (by linking); this shall be construed as a mere\nform of aggregation, provided that the complete Standard Version of the\ninterpreter is so embedded.\n\n6. The scripts and library files supplied as input to or produced as\noutput from the programs of this Package do not automatically fall\nunder the copyright of this Package, but belong to whoever generated\nthem, and may be sold commercially, and may be aggregated with this\nPackage.  If such scripts or library files are aggregated with this\nPackage via the so-called \"undump\" or \"unexec\" methods of producing a\nbinary executable image, then distribution of such an image shall\nneither be construed as a distribution of this Package nor shall it\nfall under the restrictions of Paragraphs 3 and 4, provided that you do\nnot represent such an executable image as a Standard Version of this\nPackage.\n\n7. C subroutines (or comparably compiled subroutines in other\nlanguages) supplied by you and linked into this Package in order to\nemulate subroutines and variables of the language defined by this\nPackage shall not be considered part of this Package, but are the\nequivalent of input as in Paragraph 6, provided these subroutines do\nnot change the language in any way that would cause it to fail the\nregression tests for the language.\n\n8. Aggregation of this Package with a commercial distribution is always\npermitted provided that the use of this Package is embedded; that is,\nwhen no overt attempt is made to make this Package's interfaces visible\nto the end user of the commercial distribution.  Such use shall not be\nconstrued as a distribution of this Package.\n\n9. The name of the Copyright Holder may not be used to endorse or promote\nproducts derived from this software without specific prior written permission.\n\n10. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR\nIMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED\nWARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n\n                                The End\n",
    "Name": "text-unidecode",
    "URL": "https://github.com/kmike/text-unidecode/",
    "Version": "1.3"
  },
  {
    "Author": "Markus Binsteiner",
    "Description": "Data to objects.",
    "License": "\"The Parity Public License 6.0.0\"",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/tings-0.1.dev126+gf82bc60.dist-info/LICENSE",
    "LicenseText": "The Parity Public License 6.0.0\n\nContributor: Markus Binsteiner\n\nSource Code: https://gitlab.com/frkl/tings\n\n\nThis license lets you use and share this software for free, as\nlong as you contribute software you make with it. Specifically:\n\nIf you follow the rules below, you may do everything with this\nsoftware that would otherwise infringe either the contributor's\ncopyright in it, any patent claim the contributor can license,\nor both.\n\n1. Contribute changes and additions you make to this software.\n\n2. If you combine this software with other software, contribute\n   that other software.\n\n3. Contribute software you develop, deploy, monitor, or run with\n   this software.\n\n4. Ensure everyone who gets a copy of this software from you, in\n   source code or any other form, gets the text of this license\n   and the contributor and source code lines above.\n\n5. Do not make any legal claim against anyone accusing this\n   software, with or without changes, alone or with other\n   software, of infringing any patent claim.\n\nTo contribute software, publish all its source code, in the\npreferred form for making changes, through a freely accessible\ndistribution system widely used for similar source code, and\nlicense contributions not already licensed to the public on terms\nas permissive as this license accordingly.\n\nYou are excused for unknowingly breaking 1, 2, or 3 if you\ncontribute as required, or stop doing anything requiring this\nlicense, within 30 days of learning you broke the rule.\n\n**As far as the law allows, this software comes as is, without\nany warranty, and the contributor will not be liable to anyone\nfor any damages related to this software or this license, for any\nkind of legal claim.**\n",
    "Name": "tings",
    "URL": "https://gitlab.com/frkl/tings",
    "Version": "0.1.dev126+gf82bc60"
  },
  {
    "Author": "William Pearson",
    "Description": "Python Library for Tom's Obvious, Minimal Language",
    "License": "MIT License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/toml-0.10.1.dist-info/LICENSE.txt",
    "LicenseText": "The MIT License\n\nCopyright 2013-2019 William Pearson\nCopyright 2015-2016 Julien Enselme\nCopyright 2016 Google Inc.\nCopyright 2017 Samuel Vasko\nCopyright 2017 Nate Prewitt\nCopyright 2017 Jack Evans\nCopyright 2019 Filippo Broggini\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in\nall copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN\nTHE SOFTWARE.",
    "Name": "toml",
    "URL": "https://github.com/uiri/toml",
    "Version": "0.10.1"
  },
  {
    "Author": "Xiaming Chen",
    "Description": "A Python 2/3 implementation of tree structure.",
    "License": "Apache Software License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/treelib-1.6.1.dist-info/LICENSE",
    "LicenseText": "treelib - Simple to use for you.\nPython 2/3 Tree Implementation\n\nCopyright (C) 2011\n    Brett Alistair Kromkamp - brettkromkamp@gmail.com\nCopyright (C) 2012-2017\n    Xiaming Chen - chenxm35@gmail.com\n    and other contributors.\nAll rights reserved.\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.",
    "Name": "treelib",
    "URL": "https://github.com/caesar0301/treelib",
    "Version": "1.6.1"
  },
  {
    "Author": "Guido van Rossum, Jukka Lehtosalo, Lukasz Langa, Michael Lee",
    "Description": "Backported and Experimental Type Hints for Python 3.5+",
    "License": "Python Software Foundation License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/typing_extensions-3.7.4.2.dist-info/LICENSE",
    "LicenseText": "A. HISTORY OF THE SOFTWARE\n==========================\n\nPython was created in the early 1990s by Guido van Rossum at Stichting\nMathematisch Centrum (CWI, see http://www.cwi.nl) in the Netherlands\nas a successor of a language called ABC.  Guido remains Python's\nprincipal author, although it includes many contributions from others.\n\nIn 1995, Guido continued his work on Python at the Corporation for\nNational Research Initiatives (CNRI, see http://www.cnri.reston.va.us)\nin Reston, Virginia where he released several versions of the\nsoftware.\n\nIn May 2000, Guido and the Python core development team moved to\nBeOpen.com to form the BeOpen PythonLabs team.  In October of the same\nyear, the PythonLabs team moved to Digital Creations (now Zope\nCorporation, see http://www.zope.com).  In 2001, the Python Software\nFoundation (PSF, see http://www.python.org/psf/) was formed, a\nnon-profit organization created specifically to own Python-related\nIntellectual Property.  Zope Corporation is a sponsoring member of\nthe PSF.\n\nAll Python releases are Open Source (see http://www.opensource.org for\nthe Open Source Definition).  Historically, most, but not all, Python\nreleases have also been GPL-compatible; the table below summarizes\nthe various releases.\n\n    Release         Derived     Year        Owner       GPL-\n                    from                                compatible? (1)\n\n    0.9.0 thru 1.2              1991-1995   CWI         yes\n    1.3 thru 1.5.2  1.2         1995-1999   CNRI        yes\n    1.6             1.5.2       2000        CNRI        no\n    2.0             1.6         2000        BeOpen.com  no\n    1.6.1           1.6         2001        CNRI        yes (2)\n    2.1             2.0+1.6.1   2001        PSF         no\n    2.0.1           2.0+1.6.1   2001        PSF         yes\n    2.1.1           2.1+2.0.1   2001        PSF         yes\n    2.1.2           2.1.1       2002        PSF         yes\n    2.1.3           2.1.2       2002        PSF         yes\n    2.2 and above   2.1.1       2001-now    PSF         yes\n\nFootnotes:\n\n(1) GPL-compatible doesn't mean that we're distributing Python under\n    the GPL.  All Python licenses, unlike the GPL, let you distribute\n    a modified version without making your changes open source.  The\n    GPL-compatible licenses make it possible to combine Python with\n    other software that is released under the GPL; the others don't.\n\n(2) According to Richard Stallman, 1.6.1 is not GPL-compatible,\n    because its license has a choice of law clause.  According to\n    CNRI, however, Stallman's lawyer has told CNRI's lawyer that 1.6.1\n    is \"not incompatible\" with the GPL.\n\nThanks to the many outside volunteers who have worked under Guido's\ndirection to make these releases possible.\n\n\nB. TERMS AND CONDITIONS FOR ACCESSING OR OTHERWISE USING PYTHON\n===============================================================\n\nPYTHON SOFTWARE FOUNDATION LICENSE VERSION 2\n--------------------------------------------\n\n1. This LICENSE AGREEMENT is between the Python Software Foundation\n(\"PSF\"), and the Individual or Organization (\"Licensee\") accessing and\notherwise using this software (\"Python\") in source or binary form and\nits associated documentation.\n\n2. Subject to the terms and conditions of this License Agreement, PSF hereby\ngrants Licensee a nonexclusive, royalty-free, world-wide license to reproduce,\nanalyze, test, perform and/or display publicly, prepare derivative works,\ndistribute, and otherwise use Python alone or in any derivative version,\nprovided, however, that PSF's License Agreement and PSF's notice of copyright,\ni.e., \"Copyright (c) 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010,\n2011, 2012, 2013, 2014 Python Software Foundation; All Rights Reserved\" are\nretained in Python alone or in any derivative version prepared by Licensee.\n\n3. In the event Licensee prepares a derivative work that is based on\nor incorporates Python or any part thereof, and wants to make\nthe derivative work available to others as provided herein, then\nLicensee hereby agrees to include in any such work a brief summary of\nthe changes made to Python.\n\n4. PSF is making Python available to Licensee on an \"AS IS\"\nbasis.  PSF MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR\nIMPLIED.  BY WAY OF EXAMPLE, BUT NOT LIMITATION, PSF MAKES NO AND\nDISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS\nFOR ANY PARTICULAR PURPOSE OR THAT THE USE OF PYTHON WILL NOT\nINFRINGE ANY THIRD PARTY RIGHTS.\n\n5. PSF SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF PYTHON\nFOR ANY INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS AS\nA RESULT OF MODIFYING, DISTRIBUTING, OR OTHERWISE USING PYTHON,\nOR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF.\n\n6. This License Agreement will automatically terminate upon a material\nbreach of its terms and conditions.\n\n7. Nothing in this License Agreement shall be deemed to create any\nrelationship of agency, partnership, or joint venture between PSF and\nLicensee.  This License Agreement does not grant permission to use PSF\ntrademarks or trade name in a trademark sense to endorse or promote\nproducts or services of Licensee, or any third party.\n\n8. By copying, installing or otherwise using Python, Licensee\nagrees to be bound by the terms and conditions of this License\nAgreement.\n\n\nBEOPEN.COM LICENSE AGREEMENT FOR PYTHON 2.0\n-------------------------------------------\n\nBEOPEN PYTHON OPEN SOURCE LICENSE AGREEMENT VERSION 1\n\n1. This LICENSE AGREEMENT is between BeOpen.com (\"BeOpen\"), having an\noffice at 160 Saratoga Avenue, Santa Clara, CA 95051, and the\nIndividual or Organization (\"Licensee\") accessing and otherwise using\nthis software in source or binary form and its associated\ndocumentation (\"the Software\").\n\n2. Subject to the terms and conditions of this BeOpen Python License\nAgreement, BeOpen hereby grants Licensee a non-exclusive,\nroyalty-free, world-wide license to reproduce, analyze, test, perform\nand/or display publicly, prepare derivative works, distribute, and\notherwise use the Software alone or in any derivative version,\nprovided, however, that the BeOpen Python License is retained in the\nSoftware, alone or in any derivative version prepared by Licensee.\n\n3. BeOpen is making the Software available to Licensee on an \"AS IS\"\nbasis.  BEOPEN MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR\nIMPLIED.  BY WAY OF EXAMPLE, BUT NOT LIMITATION, BEOPEN MAKES NO AND\nDISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS\nFOR ANY PARTICULAR PURPOSE OR THAT THE USE OF THE SOFTWARE WILL NOT\nINFRINGE ANY THIRD PARTY RIGHTS.\n\n4. BEOPEN SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF THE\nSOFTWARE FOR ANY INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS\nAS A RESULT OF USING, MODIFYING OR DISTRIBUTING THE SOFTWARE, OR ANY\nDERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF.\n\n5. This License Agreement will automatically terminate upon a material\nbreach of its terms and conditions.\n\n6. This License Agreement shall be governed by and interpreted in all\nrespects by the law of the State of California, excluding conflict of\nlaw provisions.  Nothing in this License Agreement shall be deemed to\ncreate any relationship of agency, partnership, or joint venture\nbetween BeOpen and Licensee.  This License Agreement does not grant\npermission to use BeOpen trademarks or trade names in a trademark\nsense to endorse or promote products or services of Licensee, or any\nthird party.  As an exception, the \"BeOpen Python\" logos available at\nhttp://www.pythonlabs.com/logos.html may be used according to the\npermissions granted on that web page.\n\n7. By copying, installing or otherwise using the software, Licensee\nagrees to be bound by the terms and conditions of this License\nAgreement.\n\n\nCNRI LICENSE AGREEMENT FOR PYTHON 1.6.1\n---------------------------------------\n\n1. This LICENSE AGREEMENT is between the Corporation for National\nResearch Initiatives, having an office at 1895 Preston White Drive,\nReston, VA 20191 (\"CNRI\"), and the Individual or Organization\n(\"Licensee\") accessing and otherwise using Python 1.6.1 software in\nsource or binary form and its associated documentation.\n\n2. Subject to the terms and conditions of this License Agreement, CNRI\nhereby grants Licensee a nonexclusive, royalty-free, world-wide\nlicense to reproduce, analyze, test, perform and/or display publicly,\nprepare derivative works, distribute, and otherwise use Python 1.6.1\nalone or in any derivative version, provided, however, that CNRI's\nLicense Agreement and CNRI's notice of copyright, i.e., \"Copyright (c)\n1995-2001 Corporation for National Research Initiatives; All Rights\nReserved\" are retained in Python 1.6.1 alone or in any derivative\nversion prepared by Licensee.  Alternately, in lieu of CNRI's License\nAgreement, Licensee may substitute the following text (omitting the\nquotes): \"Python 1.6.1 is made available subject to the terms and\nconditions in CNRI's License Agreement.  This Agreement together with\nPython 1.6.1 may be located on the Internet using the following\nunique, persistent identifier (known as a handle): 1895.22/1013.  This\nAgreement may also be obtained from a proxy server on the Internet\nusing the following URL: http://hdl.handle.net/1895.22/1013\".\n\n3. In the event Licensee prepares a derivative work that is based on\nor incorporates Python 1.6.1 or any part thereof, and wants to make\nthe derivative work available to others as provided herein, then\nLicensee hereby agrees to include in any such work a brief summary of\nthe changes made to Python 1.6.1.\n\n4. CNRI is making Python 1.6.1 available to Licensee on an \"AS IS\"\nbasis.  CNRI MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR\nIMPLIED.  BY WAY OF EXAMPLE, BUT NOT LIMITATION, CNRI MAKES NO AND\nDISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS\nFOR ANY PARTICULAR PURPOSE OR THAT THE USE OF PYTHON 1.6.1 WILL NOT\nINFRINGE ANY THIRD PARTY RIGHTS.\n\n5. CNRI SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF PYTHON\n1.6.1 FOR ANY INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS AS\nA RESULT OF MODIFYING, DISTRIBUTING, OR OTHERWISE USING PYTHON 1.6.1,\nOR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF.\n\n6. This License Agreement will automatically terminate upon a material\nbreach of its terms and conditions.\n\n7. This License Agreement shall be governed by the federal\nintellectual property law of the United States, including without\nlimitation the federal copyright law, and, to the extent such\nU.S. federal law does not apply, by the law of the Commonwealth of\nVirginia, excluding Virginia's conflict of law provisions.\nNotwithstanding the foregoing, with regard to derivative works based\non Python 1.6.1 that incorporate non-separable material that was\npreviously distributed under the GNU General Public License (GPL), the\nlaw of the Commonwealth of Virginia shall govern this License\nAgreement only as to issues arising under or with respect to\nParagraphs 4, 5, and 7 of this License Agreement.  Nothing in this\nLicense Agreement shall be deemed to create any relationship of\nagency, partnership, or joint venture between CNRI and Licensee.  This\nLicense Agreement does not grant permission to use CNRI trademarks or\ntrade name in a trademark sense to endorse or promote products or\nservices of Licensee, or any third party.\n\n8. By clicking on the \"ACCEPT\" button where indicated, or by copying,\ninstalling or otherwise using Python 1.6.1, Licensee agrees to be\nbound by the terms and conditions of this License Agreement.\n\n        ACCEPT\n\n\nCWI LICENSE AGREEMENT FOR PYTHON 0.9.0 THROUGH 1.2\n--------------------------------------------------\n\nCopyright (c) 1991 - 1995, Stichting Mathematisch Centrum Amsterdam,\nThe Netherlands.  All rights reserved.\n\nPermission to use, copy, modify, and distribute this software and its\ndocumentation for any purpose and without fee is hereby granted,\nprovided that the above copyright notice appear in all copies and that\nboth that copyright notice and this permission notice appear in\nsupporting documentation, and that the name of Stichting Mathematisch\nCentrum or CWI not be used in advertising or publicity pertaining to\ndistribution of the software without specific, written prior\npermission.\n\nSTICHTING MATHEMATISCH CENTRUM DISCLAIMS ALL WARRANTIES WITH REGARD TO\nTHIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND\nFITNESS, IN NO EVENT SHALL STICHTING MATHEMATISCH CENTRUM BE LIABLE\nFOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES\nWHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN\nACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT\nOF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.\n",
    "Name": "typing-extensions",
    "URL": "https://github.com/python/typing/blob/master/typing_extensions/README.rst",
    "Version": "3.7.4.2"
  },
  {
    "Author": "Lennart Regebro",
    "Description": "tzinfo object for the local timezone",
    "License": "MIT License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/tzlocal-2.1.dist-info/LICENSE.txt",
    "LicenseText": "Copyright 2011-2017 Lennart Regebro\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in\nall copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n",
    "Name": "tzlocal",
    "URL": "https://github.com/regebro/tzlocal",
    "Version": "2.1"
  },
  {
    "Author": "Ian Stapleton Cordasco",
    "Description": "URI templates",
    "License": "BSD License, Apache Software License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/uritemplate-3.0.1.dist-info/LICENSE",
    "LicenseText": "This software is made available under the terms of *either* of the licenses\nfound in LICENSE.APACHE or LICENSE.BSD. Contributions to uritemplate are\nmade under the terms of *both* these licenses.\n",
    "Name": "uritemplate",
    "URL": "https://uritemplate.readthedocs.org",
    "Version": "3.0.1"
  },
  {
    "Author": "Yury Selivanov",
    "Description": "Fast implementation of asyncio event loop on top of libuv",
    "License": "Apache Software License, MIT License",
    "LicenseFile": "UNKNOWN",
    "LicenseText": "UNKNOWN",
    "Name": "uvloop",
    "URL": "http://github.com/MagicStack/uvloop",
    "Version": "0.14.0"
  },
  {
    "Author": "Samuel Colvin",
    "Description": "Simple, modern file watching and code reload in python.",
    "License": "MIT License",
    "LicenseFile": "/tmp/ci-HBv1EaeM3A/venv/lib/python3.8/site-packages/watchgod-0.6.dist-info/LICENSE",
    "LicenseText": "The MIT License (MIT)\n\nCopyright (c) 2017, 2018, 2019, 2020 Samuel Colvin\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n",
    "Name": "watchgod",
    "URL": "https://github.com/samuelcolvin/watchgod",
    "Version": "0.6"
  }
]
